
/*	ОГОЛОШЕННЯ МАСИВІВ

	Розглянемо масив $name[], що має п'ять текстових елементів 
	Наприклад, це можуть імена учнів деякої групи:
	
				  0		1	  2	   3	 4
				Саша, Маша, Ваня, Аня, Костя
	
	1. Спочатку слід оголосити масив, тобто заповнити його даними.
		Наприклад, перший елемент масиву оголосимо:  
					$name[0]="Саша";
					...
	
	2. Далі, можна звертатися до елементів масиву 
		за іменем масиву та його номером у масиві, тобто індексом. 
		Наприклад, до першого елементу масиву можна звертатися:  $name[0] 
*/

//-----------------------------------------------------------------------------
echo"<h3>Оголошення простого масиву. 1 спосіб (змінна з індексами)</h3>";



echo"<h5>Виведемо перші два елементи масива:</h5>";



//------------------------------------------------------------------------------
echo"<h3>Оголошення простого масиву. 2 спосіб (змінна без індексів)</h3>";



echo"<h5>Виведемо наступні три елементи масива :</h5>";



//------------------------------------------------------------------------------
echo"<h3>Оголошення простого масиву. 3 спосіб : Масив array('через','кому')</h3>";



echo"<h5>Виведемо всі елементи масива використовуючи цикл for:</h5>";


