<?

/*
7.1 Заповнити масив $masiv[0…9] довільними числами використавши функцію array(). 
	Виведіть на екран цей масив у таблиці, використовауючи цикл for.
	Використайте функцію count для визначення кількості елементів масиву.
	Відображення файлу (7-1.php) може бути таким:
	
			№			1	2	3	4	5	6	7	8	9	10
		Значення		56	2	48	77	9	11	15	68	32	65
*/

// Оголошуємо масив $masiv

// Розпочинаємо виведення таблиці (width='200'). Заголовочний рядок таблиці містить дві рівні комірки
										
		
// Організуємо цикл від 0 до count($masiv) з кроком +1. У першій комірці виводимо індекси, а у другій - значення елементів масиву
		
					
// Виведення закривного тегу </table>

?>