<?
/*	7.2 Використавши команду присвоення «=» і функцію rand() заповнити масив 
	$masiv[1…10] випадковими числами. Виведіть на екран цей масив у таблиці: 
	Відображення файлу (7-2.php) може бути таким:
		№		Масив	
		1		  12
		2		  34
		3		  45
		...		 ...
		10		  89
	Підказка: 	Масив $masiv не оголошується. Значення масиву заповнюються у циклі 
				випадковими числами від 1 до 100, за допомогою функції rand(1,100)
*/
echo"<table width='200' border='1' align='center'>";

echo"<tr><th width='50%'>№</th><th width='50%'>Значення</th></tr>";

for($i=1; $i<=10; $i++){
$masiv[$i]=rand(1,100);
echo"
<tr><td align='center'>".$i."</td><td align='center'>".$masiv[$i]."</td></tr>
";
}

echo"</table>";?>