<?
/*	7.3 Оголосіть 2 масиви:   $tovar[0..9],  $price[0..9]. 
		Виведіть на екран ці два масиви у вигляді таблиці.
	
	Знайдіть середню ціну товарів. Виведіть її на екран після таблиці.
	Відображення файлу (7-3.php) може бути таким:
		№	Продукт 	Ціна
		1	хліб		4.5
		2	цукор 		10
		3	молоко 		8.5
		4	чай 		12
		5	кава 		45
		6	картопля 	3
		7	риба 		38
		8	капуста 	2.5
		9	сметана 	9.8
		10	огірки		6.5
	Середня ціна: _______
*/

$prise=array(4.5, 10, 8.5, 12, 45, 3, 38, 2.5, 9.8, 6.5);
$tovar=array("хліб", "цукор", "молоко", "чай", "кава", "картопля", "риба", "капуста", "сметана", "огірки");

echo"<table width='200' border='1' align='center'>";

echo"<tr>
<th width='20%'>№</th>
<th width='50%'>Продукт</th>
<th width='50%'>Ціна</th>
</tr>";

$sum=0;
for($i=0; $i<count($tovar); $i++){
$sum+=$prise[$i];
echo"
<tr>
<td align='center'>".($i+1)."</td>
<td align='center'>".$tovar[$i]."</td>
<td align='center'>".$prise[$i]."</td>
</tr>
";
}

echo"</table>";

$sr=$sum/count($tovar);
echo"<h3 align='center'Середня ціна:".$sr."</h3>";
?>