<?
/*	7.4 Створіть 3 масиви: 
		$name[0..9]		-	імена учнів,	
		$ukr[0..9]		-	оцінки за рік з української мови,
		$eng[0..9]		-	оцінки за рік з англійської мови.

	Програма повинна створити четвертий масив: $sb[0..9].
	Знайти:
		- середні бали з вивчення мов кожного учня (результати вивести у таблиці), 
		- середні бали з вивчення мов всіх учнів (результати вивести у останньому рядку таблиці).
	Відображення файлу (7-4.php) може бути таким:
							Успішність
		№	Імя				Укр			Англ		Середня
		1	Марія		 	7			 8			7.5
		2	Петро			10			10			10
		3	Христина 	 	9			10			...
		4	Аня 		 	9	 		 8			...
		5	Ярослав		 	8 			10
		6	Рома 			11			12
		7	Віта 		 	4	 		 7
		8	Катя 			11			10
		9	Микола 			10			10
		10	Олександр		8			9			8.5
		Середнє значення	___			___			___

		Середній бал серед всіх учнів: ___
*/
$uk=array(7,10,9,9,8,11,4,11,10,8);
$eng=array(8,10,10,8,10,12,7,10,10,9);
$name=array("Марія","Петро","Христина","Аня","Ярослав","Рома","Віта","Катя","Микола","Олександр");
echo"<h2 align='center'> Успішність</h2>";
echo"<table width='500' border='1' align='center'>";

echo"<tr>
<th width='20%'>№</th>
<th width='50%'>Ім'я</th>
<th width='50%'>Укр</th>
<th width='50%'>Англ</th>
<th width='50%'>Середня</th>
</tr>";

$kil=count($name);
$sum_uk=0;
$sum_eng=0;
for($i=0; $i<$kil; $i++){
$sb[$i]=($uk[$i]+$eng[$i])/2;
$sum_uk+=$uk[$i];
$sum_eng+=$eng[$i];
echo"<tr align='center'>
<td width='100'>".($i+1)."</td>
<td width='100'>".$name[$i]."</td>
<td width='100'>".$uk[$i]."</td>
<td width='100'>".$eng[$i]."</td>
<td width='100'>".$sb[$i]."</td>
</tr>";
}
$ser_uk=$sum_uk/$kil;
$ser_eng=$sum_eng/$kil;
$ser_znach=($ser_uk+$ser_eng)/2;

echo"
<tr align='center'>
<th colspan='2' width='100'>Середнє значення</th>
<th width='100'>".$ser_uk."</th>
<th width='100'>".$ser_eng."</th>
<th width='100'>".$ser_znach."</th>
</tr>";
echo"</table>";
echo"<h3 align='center'> Середній бал серед всіх учнів: ".$ser_znach."</h3>";





































?>