<?
/*-------------------- 12-1 ФОРМУЄМО ЗАПИТ ДО БАЗИ ДАНИХ ----------------*/

/*  ********************** ОСНОВИ РОБОТИ З БАЗОЮ ДАНИХ ******************

					FROM	WHERE (AND, OR)		ДЕ (І, АБО)
					
SELECT - Вибірка			ORDER BY			ВПОРЯДКУВАТИ ЗА
							DESC				СПАДАННЯМ
							LIMIT				кількість записів
INSERT - Вставка
UPDATE - Модифікація
DELENE - Видалення

****************  ЯК ФОРМУВАТИ ЗАПИТ ДО БАЗИ ДАНИХ?  ********************

НАПРИКЛАД:	 	Вибірка	  Всі_поля  Для		Ім'я_таблиці	Ідентифікатор_БД
mysql_query("	SELECT 		* 		FROM 	firma ", 		$db )
*/

/*  А Л Г О Р И Т М:
1.	Підключаємо стартовий файл.	Це можна зробити за допомогою інструкції   
		include "Ім'я стартового файлу"
	
2.	Формуємо запит до бази даних: Обираємо всі поля із таблиці firma
		Запишемо у змінну  $result всю матрицю таблиці  firma

3.	Витягнемо зі змінної $result перший запис таблиці у вигляді масива.
		Це можна зробити за допомогою функції    mysql_fetch_array()
		Резутьтат слід помістити у змінну  $myrow

4.	Організуємо ВИВЕДЕННЯ на екран. 
		Наприклад, для виведення поля "name" із масиву:  $myrow["name"]
		Виведемо на екран всі чотири поля:
*/
include  "start.php";

$result=mysql_query("SELECT * FROM firma", $db );

$myrow=mysql_fetch_array($result);

echo $myrow["lastname"]."<br>";

echo $myrow['id']." ".$myrow['name']." ".$myrow['lastname']."".$myrow['post'];
?>



