<?
/*	12.3 	Створити програму, яка виводить інформацію про учнів, 
			що записані в таблицю “firma”, рахує кількість учнів. 
			
При створенні програми враховуйте такі моменти:
•	Створіть файл “config.php” у якому визначаються константи доступу до бази даних;
•	Створіть файл “start1.php” у якому прописуються команди відкриття доступу до бази даних;
•	За допомогою команд:		require_once "config.php";			
								require_once "start1.php";
•	Підключіть файли   config.php  і  start1.php   до вашої програми. 
	Команда require_once  є аналогом команди include. Різниця полягає у тому, 
	що  require_once  при повторному запуску програми перевіряє чи файл 
	уже був підключений. Якщо підключений, то цей файл повторно не підключається. 
	виведіть на екран список учнів (цикл “while”). 
*/

/*	А Л Г О Р И Т М:
1. Підключення до бази даних:
	Подключаємо файл з константами доступа до бази даних  config.php 
	Відкриваємо доступ до бази даних  start1.php  (Або require_once "start.php";)
require_once"START.php";	

2. Задаємо рядкову змінну  $str  з необхідним значенням для вибірки.
	Нам потрібно відібрати тільки таких праціників фірми, для яких 
	у полі post  зазначено  "учень"

3.	Формуємо вибірку: Обираємо всі поля з таблиці firma,
		для таких записів, де посада - учень (WHERE post='$str')
		Запишемо вибірку у змінну  $query.   

4.	Формуємо запит:   mysql_query($query). 	Результат помістимо у змінну $tab.

5. Для виведення результатів використовуємо   Ц И К Л   while
	У якості умови циклу використаємо змінну ($row = mysql_fetch_array($tab)).
	Тобто цикл беде виконуватись поки не скінчаться рядки у таблиці.
	Для обчислення кількості учнів додамо лічильник циклу - змінну $i
	http://host231.itelit.pro/12/12-3.php
*/
echo"<b>Учні:</b><br>";

require_once "config.php";
require_once "start1.php";

$str= "учень";

$query="SELECT *FROM firma WHERE post='$str'";

$tab=mysql_query($query);


$i=0;
while($row=mysql_fetch_array($tab)){ 
echo $row['id']." - ".$row['name']." ".$row['lastname']."<br>";
$i++;
}
echo"<br>-Кількість учнів-".$i;
?>



