<?
/*--------------- 12-0  Робота у базі даних, імпорт таблиць -------------------

1.	Виходимо  на   phpMyAdmin	
	-	У вікні браузера вводимо адресу		http://pma.itelit.pro
	-	Вводимо	власні дані:  Логін та Пароль і натискаємо кнопку [Вперед]

2. 	У базі даних слід ВИДАЛИТИ старі таблиці, якщо вони там є !!!
	-	Обираємо зліва нашу поточну базу даних
	-	Ставим галочку перед таблицею 
	-	Натискаэмо кнопку Видалити
	
3.	ІМПОРТУЄМО таблицю   firma.sql   у власну базу даних
	-	Обираємо зліва нашу поточну базу даних
	-	Вкладка: Імпорт
	-	[Виберіть файл]...
	-	[Вперед]
	
4.	Далі слід організувати підключення до бази даних за допомогою 
	стартового файлу: start.php  
*/

/*	-------- СТАРТОВИЙ ФАЙЛ - підключення до бази даних ---------

1. 	Встановлюємо  4 константи  - HOST,  USER,  PASSWORD,  DB
	за допомогою команди:	define("ИМ'Я константи", "Значенняе константи")

2. 	Під'єднуємося до MySQL-сервера та отримаємо ідентификатор бази даних ($db)
	за допомоою функції 	mysql_connect("Хостинг", "Логін", "Пароль")

3.	Обираємо базу даних за допомогою функції	mysql_select_db(DB,$db)
	(На той випадок, якщо у нас буде декілька баз даних цій функції
	передається ім'я бази даних та її ідентификатор).

4.	Виконуємо перевірку підключення до бази даних з ідентификатором $db:
	Повідомлення про помилку: "Немає доступу до бази даних!!! ПОМИЛКА - "
			
5.	Виконуємо перевірку вибору бази даних   mysql_select_db(DB,$db)
	Повідомлення про помилку: "Неможливо вибрати базу даних!!!  ПОМИЛКА - "
			
	-	Виведення повідомлення про помилки виконуємо за допомогою команди:

6.	Формуємо запит до БД за допомогою функції mysql_query("SET NAMES 'utf8'") 
	(Цей запит встановлює кодування 'utf8' для всіх даних з нашої бази даних)
	http://host231.itelit.pro/12/start.php
*/
define("HOST", "127.0.0.1");
define("USER", "host213");
define("PASSWORD", "g3bJeH6+kOM=");
define("DB", "itelit_host213");

$db= mysql_connect(HOST, USER, PASSWORD);

mysql_select_db(DB,$db);

if(!$db){
exit("Немає доступу до бази даних!!! ПОМИЛКА - ".mysql_error());		
}

if(!mysql_select_db(DB,$db)){
exit("Неможливо вибрати базу даних!!!  ПОМИЛКА - ".mysql_error());	
}
mysql_query("SET NAMES 'utf8'");
?>



