<html>
<head>
	<TITLE>1-Вага</TITLE>
</head>
<body>
<?
/*
Тут запишіть:	Сайт/Папки/Файл

2.1	Виведення ваги
	----------------------
	Вивести по центру  екрану таблицю розміром 300 пікселів з вашою вагою і ростом, 
	попередньо помістивши вагу і зріст  у змінні $w  і $h. 
	Результат вивести у вигляді таблиці (шириною 300, з рамкою в 1 піксель, по центру): 
		моя вага 		47 кг
		мій зріст     	160 см
*/
 $w="70";
  $h="170";
  
  echo"|
  <table align='center' width='300' border='1'>
  <tr><td>моя вага </td>  <td>".$w ."</td>  <td>кг</td> </tr>
   <tr><td>мій зріст</td>  <td>". $h ."</td>  <td>см</td> </tr>
  </table>
  
  ";

?>
</body>
</html>




