<html>
<head>
<TITLE>3-Гіпотенуза</TITLE>
  </head>
  <body>
  <?
/*
Тут запишіть:	Сайт/Папки/Файл
 
2.3	Знайти гіпотенузу $c прямокутного трикутника за заданими катетами $a і $b.
	Результат вивести у вигляді таблиці (як у попередній задачі): 
		катет	А 			4 см
		катет 	B          	3 см
		гіпотенуза С		? см
		
Теорема Піфагора:	Квадрат гіпротенузи дорівнює сумі квадратів катетів		
*/
$a="4";
$b="3";
$c=sqrt(pow($a,2) +pow($b,2));
echo"
<table align='center' width='300' border='1'>
<tr>   <td>катет a</td>  <td>".$a."</td>    <td>см</td>   </tr>
<tr>   <td>катет b</td>  <td>".$b."</td>    <td>см</td>   </tr>
<tr>   <td>гіпотенуза c</td>  <td>". $c."</td>    <td>см</td>   </tr>

</table>

";
?>
</body>
</html>

 

	



