----------------------- Тема 2.  З А Д А Ч І ---------------------

Тема 2. Математичні функції.

------------------------------------------------------------------

2.1 Вивести по центру  екрану таблицю розміром 300 пікселів з вашою вагою і ростом, 
	попередньо помістивши вагу і ріст  у змінні $w  і $h. 
	Результат вивести у вигляді таблиці (шириною 300, з рамкою в 1 піксель, по центру): 
		моя вага 		47 кг
		мій зріст     	160 см
----- 		
2.2 Обчислити площу кола і об’єм кулі з радіусом  r = 12 см 
	(формули для обчислень знайти в Інтернеті). 
	Площу кола і об’єм кулі вивести заокругливши два знаки після коми. 
	Використовуй функції.
	Результат вивести у вигляді таблиці (як у попередній задачі): 
		радіус 			12 см
		площа кола		452.39 см2
		об'єм кулі		7238.23 см3
----- 		
2.3 Знайти гіпотенузу $c прямокутного трикутника за заданими катетами $a і $b.
	Результат вивести у вигляді: 
		катет a 			4 см
		катет b          	3 см
		гіпотенуза c		5 см
----------------------------------------------------------------------------------