<?
/*

4-1_form.php
	Створіть запитання до тесту з перевіркою чи вірно відповів користувач.
	
	Відображення форми повинно бути таким:
	
			У якому році проголошений Акт незалежності України? 
			(додаткові атрибути для тегу input: size="2" maxlength="4")
		
			Кнопка [ Перевірити]
*/
?>
<form action="04-1-akt.php" method="POST">

 У якому році проголошений Акт незалежності України? 
 <input name="year" type="text" size="2" maxlength="4" >
 <input name="button" type="submit" value="Перевірити" >
 </form>