<?
/*
4.4 Власник магазину по продажі молока платить зарплату продавцю в залежності 
	від кількості проданих літрів. 	Якщо продавець продав: 
		- менше 1000л то він отримує 20% зарплати від суми проданого молока,
		- якщо продавець продав 1000л і більше, але менше 2000л, то отримає 25% зарплати, 
		- якщо продавець продав 2000л і більше, то отримає 30%. 
	Створити програму яка обчислює зарплату продавцю, якщо 1л молока коштує ??? грн.

-------- 20% = 0.2 -------		   		 	  			 ---------- 30% = 0.3 ---------						
__________________________1000___________________________2000__________________________

                          -------- 25% = 0.25 -----------

	Результат вивести у вигляді:	"Зарплата продавця = ______ грн."
*/
$l=$_POST['l'];
$one=$_POST['one'];

if($l>1000){
   $zp=$l*$one*0.2;	
}
else     if($l>2000){
   $zp=$l*$one*0.25;	
}
else
  $zp=$l*$one*0.3;	

echo"Ваша зарплата=".$zp."";
?>









