<?
/*	
4.5 Створити програму «Ваша вага». Вхідні дані: ваша вага, ваш ріст.  

	Обчислення норми:
			
	Нормальна вага обчислюється за формулою:	Норма = зріст – 100
	Нормою є теж вага більша і менша на 10% від норми.
	
		Наприклад: 
	Якщо ваш зріст 160 см і важите 51 кг, то нормою є  160-100=60кг, +/- 10%. 
	Від норми 10% - це 60*0.1=6кг, тому нормальною є вага 60 +/- 6 кг (від 54 до 66). 
	Якщо ваша вага 51кг, тоді ви важите менше норми на  54-51 = 3 кг. 

						  ------------------------------------
----- збільшити вагу -----  	          $norm 		      ---- схуднути на $kilo----		
__________________________$min____________________________$max__________________________

                          -10%							  +10%

			РЕЗУЛЬТАТИ:
	1. Якщо ваша вага є нормою, тоді на екран виводиться повідомлення: 
			"Вітаю! Ваша вага у межах норми!" 
	2. Якщо ваша вага більше норми, тоді на екран виводиться повідомлення: 
			"Ви важите більше норми. Вам слід схуднути на ... кг"
	3. Якщо ваша вага менше норми, тоді на екран виводиться повідомлення: 
			"Ви важите менше норми. Вам слід збільшити Вашу вагу на ... кг"
*/
$m=$_POST['m'];
$hight=$_POST['hight'];


$norm=$hight - 100;
$min=$norm - $norm*0.1;
$max=$norm + $norm*0.1;


if($m<$min){
	$kilo=$min - $m;
	echo"Ви важите менше норми. Вам слід збільшити Вашу вагу на ".round($kilo,0)." кг";
}
else   if($m<=$min){
	 echo"Вітаю! Ваша вага у межах норми!" ;
} 
else{
	$kilo=$m - $max;
	echo"Ви важите більше норми. Вам слід схуднути на".round($kilo,0)."  кг";
} 



?>
