<?
/* 
4.6 Створити програму, що визначає тип трикутника 
	(прямокутний, рівносторонній, рівнобедренний, різносторонній) 
	по введених трьох сторонах. 

	Відображення файла-обробника при введені чисел ... повинно бути таким:
		"Трикутник зі сторонами 5, 4, 3 - прямокутний"
	
	+ Обчисліть також площу трикутника.
	+ Додайте перевірку на існування трикутника
*/

$a=$_POST['a']; 
$b=$_POST['b']; 
$c=$_POST['c']; 

if(($a+$b)<=$c or ($a+$c)<=$b or($c+$b)<=$a){
echo"<br>Трикутника не існує";
}
else{


if(pow($a,2)==pow($b,2)+pow($c,2) or pow($b,2)==pow($a,2)+pow($c,2) or pow($c,2)==pow($b,2)+pow($a,2)){
echo"Трикутник зі сторонами ".$a.", ".$b.", ".$c."- прямокутний";
}
else if($a==$b and $b==$c and $a==$c){
echo"<br>Трикутник зі сторонами ".$a.", ".$b.", ".$c." -рівносторонній";
}

else if($a==$b or $b==$c){
echo"<br>Трикутник зі сторонами ".$a.", ".$b.", ".$c." - рівнобедренний";
}

else if($a!=$b or $b!=$c or $a!=$c){
	echo"<br>Трикутник зі сторонами ".$a.", ".$b.", ".$c." - різносторонній";
}
}

$p=$a+$b+$c;

$S=sqrt($p*($p-$a)*($p-$b)*($p-$c));
echo"<br>Площа трикутника=  ".round($S)." ";
?>

