--------------------- 04.  Конструкція  if … else  ------------------------

	Після  if у круглих дужках записується умова (логічний вираз). 
	
Наприклад:		if($a>0)	- якщо змінна $a більша нуля... 

	Умова перевіряється. Результатом перевірки умови може бути або «так», або «ні». 
Наприклад, якщо у змінній $a лежить число 5, тоді  $a > 0 – тобто ми отримаємо «так». 
Якщо ми отримали «так» тоді виконуються команди записані у фігурних дужках після if (якщо)
Якщо умова не виконується (наприклад, у змінній $a лежить число 0), тобто ми отримали «ні», 
тоді виконуються команди, що записані в фігурних дужках після команди else (інакше).

	if (умова){				Якщо умова вірна...
		«серія команд 1»;
	} 
	else{					інакше...
		«серія команд 2»;
	}

Перед і після фігурних дужок «;» не ставиться!
--------------------------------------------------------
Умови (логічні вирази) можуть бути простими і складеними:

Прості умови:
	$a > $b    			$a більше $b;
	$a < $b   			$a менше $b;
	$a == $b  			$a рівне $b;
	$a >= $b  			$a більше рівне $b;
	$a <= $b  			$a менше рівне $b;
	$a != $b   			$a не дорівнює $b;
	
Складені умови:
	$t>0  and  $t<=100 		$t більше 0 і менше рівне 100.  
	$t<10  or  $t>50		$t менше 10 або  $t більше 50. 
----------------------------------------------------------

