4.1 Створіть запитання до тесту з перевіркою чи вірно відповів користувач. 
	
	У якому році проголошений Акт незалежності України? «________»
		Кнопка [ Перевірити]
	Результат вивести у вигляді: 
		"Ви відповіли вірно" або "Ви помилились"

4.2 Визначити агрегатний стан води по її температурі.

4.3 За перший товар ви заплатили гривнями, за другий товар заплатили доларами. 
	Визначити який товар коштує дорожче,якщо один долар коштує 8.7 грн.

4.4 Власник магазину по продажі молока платить зарплату продавцю в залежності від кількості проданих літрів. 
	Якщо продавець продав менше 1000л то він отримує 20% зарплати від суми проданого молока,
	якщо продавець продав >= 1000 л але менше 2000 л то отримає 25% зарплати, 
	якщо >=2000л то отримає 30%. Створити програму яка обчислює зарплату продавцю, якщо 1л=6 грн.

4.5 Створити програму "Ваша вага". Вхідні дані: ваша вага, ваш ріст.  Дія програми:
	1. Якщо ваша вага є нормою, тоді на екран виводиться повідомлення: "Ваша вага нормальна." 
	2. Якщо ваша вага більше норми, тоді на екран виводиться повідомлення: 
		"Ви важите більше норми, вам необхідно похудати на …. кг."
	3. Якщо ваша вага менше норми, тоді на екран виводиться повідомлення: 
		"Ви важите менше норми, вам необхідно поправитись  на …. кг."
	Нормальна вага обчислюється за формулою:		Норма = ріст у сантиметрах - 100
	Нормою є також вага більша і менша на 10% від норми. 
	Наприклад: 
	Якщо ви маєте ріст 160 см і важите 51 кг, тоді нормою є 60 кг (160-100). 
	10% від норми є 6 кг (1/10 від 60 кг), тому норма є від 54 кг до 66 кг, якщо ваша вага 51кг, 
	тоді ви важите менше норми на 3 кг. 
	Отже відповідь комп'ютера: "Ви важите менше норми, вам необхідно поправитись на 3 кг."

4.6 Створити програму, що визначає тип трикутника (різносторонній, рівносторонній, прямокутний) 
	по введених трьох сторонах.
	Відображення форми повинно бути таким:
	Введіть довжини сторін трикутника.
		А = "________"
		B = "________"
		C = "________"
	[визначити тип трикутника]
	
Відображення файла-обробника при введені чисел 5, 4, 3 повинно бути таким: "Трикутник прямокутний"





