<?
/*
3-0
	Створити програму, що складатиметься з двох файлів: 03-0_form.php  і  03-0-poassword.php  
	У першому файлі (3-0_form.php) розмістіть форму, яка складатиметься з трьох елементів: 
	це два поля для введення тексту: логіну і паролю, та одного поля - кнопки. 
**************************************************************************************

-	Спочатку запускається Форма, у яку користувач повинен ввести необхідні дані.

-	По натисканню кнопки, введені користувачем дані, передаються  
	у файл-обробник  "3-0_password.php".  Передаються дані методом  "POST", 
	у вигляді глобальної змінної   $_POST['імя_змінної']
	
-	Далі, запускається файл - обробник "3-0_password.php", у якому виконуються обчислення

*/

?>
<form name="myform" action="03-0_password.php" method="POST">

	Введіть логін:     	
	<input name="login" type="text"><br><br>

	Введіть пароль: 	
	<input name="passw" type="password"><br><br>

	<input name="knopka" type="submit" value="Ok">
</form>






