<?
/*
3.1 (Задача 1.3 з першої теми)
	-	Створи форму "3-1_form.php" для введення даних: 
	
			Введіть ширину кімнати: 	«____» 		"width" 
			Введіть	довжину кімнати: 	«____» 		"length"	- поля для введення даних,
			Введіть	висоту кімнати:  	«____» 		"height"
						
			[Обчислити]							– копка відправки форми
			
	-	Додайте до тегу input ще один атрибут size="2"		
	
	-	Створити програму-обробник "3-1-room.php", що обчислює площу і об’єм класної кімнати...  
*/
?>
<form name="myform" action="03-1-room.php" method="POST">

	   	Введіть ширину кімнати:
	<input name="width" type="text"><br><br>

		Введіть	довжину кімнати:
	<input name="length" type="text"><br><br>
	
	Введіть	висоту кімнати: 
	<input name="height" type="text"><br><br>

	<input name="knopka" type="submit" value="Обчислити">
</form>
