<?
/*
3.1 (Задача 1.3 з першої теми)
	
	-	Створити програму-обробник "3-1-room.php", що обчислює площу і об’єм класної кімнати.  
		Розміри класу: ширина – 5,2 м;  довжина – 7,4 м; висота 2,8 м.
			
			Результат вивести у вигляді: 
		Площа класної кімнати з шириною - 5.2 м2, довжиною - 7.4 м2  дорівнює 38.48 м2
		Об'єм цієї ж кімнати при висоті - 2.8 м2 дорівнює 107.744 м3
*/
//Локальним змінним надамо значення глобальних 
$width = $_POST['width'];

$length = $_POST['length'];

$height = $_POST['height'];

//Обчислення площі та об'єму кімнати
$S= $width * $length;
$V=$S * $height;
//Виведення на екран методом пристиковки
echo"Площа класної кімнати з шириною - ".$width." м<sup>2</sup>, довжиною - ".$length." м<sup>2</sup>  дорівнює ".$S." м<sup>2</sup> <br>";
echo"Об'єм цієї ж кімнати при висоті - ".$height."м<sup>2</sup> дорівнює ".$V."м<sup>3</sup><br>";
?>
