<?
/*
3.2 Обчислити площу круга і об’єм кулі із заданим радіусом. 
			Площу круга і об’єм кулі вивести заокругливши до сотих. 
			Результат вивести у вигляді таблиці. 
		
	-	Створи форму 3-2_form.php для введення даних.
			Ввести радіус круга: «____».
			Та кнопку "Обчислити"
			
	-	Програма-обробник: 03-2-kulya.php
*/

?>
<form name="myform" action="03-2-kulya.php" method="POST">

	  Ввести радіус круга :
	<input name="r" type="text"><br><br>


	<input name="knopka" type="submit" value="Обчислити">
</form>