<? 
/* 
2.3	Знайти гіпотенузу $c прямокутного трикутника за заданими катетами $a і $b.

	Результат вивести у вигляді таблиці: 
		катет	А 			4 см
		катет 	B          	3 см
		гіпотенуза С		5 см

*/


// Приймаємо глобальні змінні у одноіменні локальні $a і $b
$a=$_POST['a'];
$b=$_POST['b'];
// Обчислення гіпотенузи за теоремою Піфагора
$c=sqrt(pow($a,2)+pow($b,2));

echo"
<table width='300'  border='1' align='center'

<tr>    <td>катет	<b><i>a</i></b></td>     <td>".$a."</td>   <td>см</td> </tr>

<tr>    <td>катет	<b><i>b</i></b></td>     <td>". $b."</td>   <td>см</td> </tr>

<tr>    <td>гіпотенуза<b><i>c</i></b> </td>     <td>".round ($c,2)."</td>   <td>см</td> </tr>
</table>

";
?>



