<?
/*

3-5.	Створити універсальну програму обчислення вартості цегли для стіни заданих розмірів 
		(висоти, довжини, товщини). Також у програму потрібно ввести вартість 1 цеглини. 
		Потрібно врахувати, що на 1 метр кубічний стіни йде 380 цеглин.

	-	Створи форму 3-5_form.php для введення даних:
	
		<h3>Обчислення вартості цегли для стіни:</h3>
		
		Введіть розміри стіни:
				висоту  h : 	«____»  
				довжину l : 	«____»  				
				товщину w :  	«____» 
				
		Введіть вартість 1 цеглини vart1 : «____»   
				
		[Обчислити вартість стіни]					– кнопка відправки форми			
			
	
	-	Програма-обробник: 3-5-bricks.php	

*/

?>
<form name="myform" action=" 03-5-bricks.php	" method="POST">
<h4>Введіть розміри стіни:</h4>
	 висоту
	<input name="h" type="text"><br><br>

     довжину
	 <input name="l" type="text"><br><br>
	 
	 товщину
	  <input name="w" type="text"><br><br>
	  
	  Введіть вартість 1 цеглини
	  <input name="vart1" type="text"><br><br>
	  
	<input name="knopka" type="submit" value="Обчислити вартість стіни">
</form>
		


