<?
/*
3-5.	Створити універсальну програму обчислення вартості цегли для стіни заданих розмірів 
		(висоти, довжини, товщини). Також у програму потрібно ввести вартість 1 цеглини. 
		Потрібно врахувати, що на 1 метр кубічний стіни йде 380 цеглин.
		
		Результат вивести у вигляді: 

<h3>Обчислення вартості цегли для стіни:</h3>

висота		довжина		товщина		варт.1_цегл.	об'єм_стіни		кільк.цегол		варт.стіни
3 м			10 м		0.51 м		5 грн			15.3 м3 		5814 шт			29070 грн		
*/	

// Приймаємо глобальні змінні у локальні $h, $l, $w  і  $vart1 - вартість 1 цеглини
$h=$_POST['h'];
$l=$_POST['l'];
$w=$_POST['w'];
 $vart1=$_POST['vart1'];

// Обчислення об'єму стіни $V:
 $V=$h*$l*$w;		

// Обчислення кількості цеглин $N, якщо на 1 м3 стіни йде 380 цеглин:
$N=380*$V;			

// Обчислення вартості стіни $vartN: 
$vartN=$N*$vart1;




echo "  
<table align ='center'  width='300' border='1px'>

<tr> <td>висота</td>  <td>".$h." </td>                    <td>м</td>   </tr>                                      
<tr> <td>довжина</td>  <td>".round($l,2)." </td>  <td>м</td> </tr> 
<tr> <td>товщина</td>  <td>".round($w,2)." </td>  <td>м</td> </tr> 
<tr> <td>варт.1_цегл.</td>  <td>".round($vart1,2)." </td>  <td>грн</td> </tr> 
<tr> <td>об'єм_стіни</td>  <td>".round($V,2)." </td>  <td>м3</td> </tr> 
<tr> <td>кільк.цегол	</td>  <td>".round($N,2)." </td>  <td>шт</td> </tr> 
<tr> <td>варт.стіни</td>  <td>".round($vartN,2)." </td>  <td>грн	</td> </tr> 
</table>"

?>		

