<?
/*
3-6.Обчислити площу трикутника за заданими довжинами сторін. Формула Герона.
	
		Результат вивести у вигляді:

			<h3>Обчислення площі трикутника. Формула Герона.</h3>
		
			Трикутник зі сторонами 5, 4, 3 см, має площу 6 см2		
		
*/

// Приймаємо глобальні змінні - сторони трикутника
$a=$_POST['a'];
$b=$_POST['b'];
$c=$_POST['c'];
// Обчислення півпериметра трикутника 
$p=($a+$b+$c)/2;


// Формула Герона містить функцію КОРІНЬ - sqrt(...)
$S=sqrt($p*($p-$a)*($p-$b)*($p-$c));
 
echo "Трикутник зі сторонами".$a.",".$b.",".$c." см, має площу 6 см2	";
?>


