<?
/*

3-6.Обчислити площу трикутника за заданими довжинами сторін. 
	Формула Герона.
	
	-	Створи форму 3-6_form.php для введення даних.
		<h3>Обчислення площі трикутника:</h3>
		
		Введіть довжини сторін трикутника, 
			a =  «____»  
			b =  «____»   
			c =  «____»  
			
		[Обчислити площу трикутника]

	-	Програма-обробник: 3-6-geron.php	
*/
?>
<h3> Обчислення площі трикутника</h3>
<form name="myform" action="03-6-geron.php" method="POST"> 
<h4>Введіть довжини сторін трикутника</h4>
	 a=
	<input name="a" type="text"><br><br>

     b=
	 <input name="b" type="text"><br><br>
	 c=
	<input name="c" type="text"><br><br> 
	<input name="knopka" type="submit" value="Обчислити площу трикутника">
</form>


