Теорія:
----------------------------------------------------
Створення простої форми. Метод передачі даних POST.
----------------------------------------------------

Ось приклад найпростішої форми. 	Файл  3-0_form.php :
----------------------------
Форма складається з трьох елементів: 
	це два текстових ("text") поля для введення логіну і паролю, 
	та однієї кнопки ("submit"). 

----------------------------------------------------
Ф О Р М А  (3-0_form.php) :
----------------------------------------------------
<form name="myform" action="03-0_password.php" method="POST">

	Введіть логін:     	
	<input name="login" type="text"><br><br>

	Введіть пароль: 	
	<input name="passw" type="password"><br><br>

	<input name="knopka" type="submit" value="Ok">
</form>
----------------------------------------------------

-	Спочатку запускається Форма, у яку користувач повинен ввести необхідні дані.

-	По натисканню кнопки, введені користувачем дані, передаються  
	у файл-обробник  "3-0_password.php".  Передаються дані методом  "POST", 
	у вигляді глобальної змінної   $_POST['імя_змінної']
	
-	Далі, запускається файл - обробник "3-0_password.php", у якому виконуються обчислення

----------------------------------------------------
Ф А Й Л - О Б Р О Б Н И К   (3-0_password.php)
----------------------------------------------------
-	Форма передає дві глобальні змінні у файл-обробник:  
		$_POST['login']  та  $_POST['passw']
		
-	Для спрощення роботи з глобальними змінними створимо одноіменні 
		локальні змінні: $login та $passw
		
-	Виведемо на екран результати: локальні змінні
----------------------------
<?

$login = $_POST['login'];
$passw = $_POST['passw'];

echo  "Ваш логін:  ". $login."<br>";
echo  "Ви ввели пароль:  ". $passw;

?>


