----------------------- Тема 3.  З А Д А Ч І ---------------------
Створення простої форми. Метод передачі даних POST.
------------------------------------------------------------------
3.0 
	Створити програму, що складатиметься з двох файлів: 3-0_form.php  і  3-0-poassword.php  
	У першому файлі (3-0_form.php) розмістіть форму, яка складатиметься з трьох елементів: 
	це два поля для введення тексту: логіну і паролю, та одного поля - кнопки. 
	Другий файл - обробник (3-0_poassword.php) повинен містити дві команди виведення 
	з логіном та паролем, які користувач уводить у першому файлі формі.
-----
3.1 (Задача 1.3 з першої теми)
	-	Створи форму "3-1_form.php" для введення даних: 
	
			Введіть ширину кімнати: 	«____» 		"width" 
			Введіть	довжину кімнати: 	«____» 		"length"	- поля для введення даних,
			Введіть	висоту кімнати:  	«____» 		"height"
						
			[Обчислити]							– копка відправки форми
	
	-	Створити програму-обробник "3-1-room.php", що обчислює площу і об’єм класної кімнати.  
		Розміри класу: ширина – 5,2 м;  довжина – 7,4 м; висота 2,8 м.
			Результат вивести у вигляді: 
		Площа класної кімнати з шириною - 5.2 м2, довжиною - 7.4 м2  дорівнює 38.48 м2
		Об'єм цієї ж кімнати при висоті - 2.8 м2 дорівнює 107.744 м3
-----
3.2 (Задача 2.2 з другої теми)
	-	Створи форму 3-2_form.php для введення даних.
	
			Ввести радіус кола: «____».
									
	-	Програма-обробник: 3-2-kulya.php
			Обчислити площу круга і об’єм кулі із заданим радіусом. 
			Площу круга і об’єм кулі вивести заокругливши до сотих. 
			Результат вивести у вигляді таблиці. 
-----
3.3 (Задача 2.3 з другої теми)
	-	Створи форму 3-3_form.php для введення даних: катетів прямокутного трикутника $a і $b.
	-	Програма-обробник: 3-3-gipotenuza.php
		Знайти гіпотенузу прямокутного трикутника по заданих величинах його катетів $a і $b, 
		за теоремою Піфагора. Результат вивести у вигляді таблиці. 
-----
3.4 (Задача 1.4 з першої теми)
	-	Створи форму 3-4_form.php для введення середньої швидкості руху автомобіля $V та відстані $S
	-	Створити програму-обробник 3-4-time.php, що обчислює час руху автомобіля з міста А до міста В, 
		якщо, наприклад, середня швидкість руху – 60 км/год , а відстань від Рівного до Києва – 327км.
								V=S/t , тоді  t=S/V
	Результат вивести у вигляді: 
		Автомобіль, що рухається з середньою швидкістю  60 км/год  км/год,
		з Рівного до Києва дістанеться за _____ год.					
-----
3.5 
	Створити універсальну програму обчислення вартості цегли для стіни заданих розмірів 
	(висоти, довжини, товщини).	Також у програму потрібно ввести вартість 1 цеглини. 
	Потрібно врахувати, що на 1 метр кубічний стіни йде 380 цеглин.
	Відображення 1 файлу повинно бути таким:
	
		Введіть розміри стіни:
				висоту: 	«____»  
				довжину: 	«____»  				
				товщину:  	«____» 
				
		Введіть вартість 1 цеглини: «____»   
				
		[Обчислити вартість стіни]					– кнопка відправки форми

				Результат вивести у вигляді таблиці: 
	висота		довжина		товщина		об'єм стіни		к-сть цегол		вартість
	3 м			10 м		0.51 м		15.3 м3 		5814 шт			8721грн

-----
3.6 
	Обчислити площу трикутника за заданими довжинами сторін (формула Герона). 
	Відображення форми повинно бути таким:
	
	Введіть довжини сторін трикутника, 
			а =  «____»  
			b =  «____»   
			с =  «____»  
			
	[Обчислити площу трикутника]

			Результат вивести у вигляді: 
	Трикутник з сторонами 5, 4, 3 см, має площу 6 см2
-----------------------------------------------------









