<form action="11-3.php" method="POST">
      <h3>Введіть рядок</h3>
	  <input type="text" name="str" size="100" /><br><br>
	  <input type="submit" />
</form>



<?    
/*Створити програму, яка з рядка $r видаляє три зайві символи, замінюючи їх на 1. 
	  Наприклад,якщо користувач ввів рядок: 
	  "Осссь пррриклад PHP-коооду,,, що з’єднуєєє вашу прооограму з бааазою даних..." 
	  програма повинна перетворити його у такий:   
	  "Ось приклад PHP-коду, що з’єднує вашу програму з базою даних." 
	  
	  trim($r)					- видаляє зайві пропуски
	  
	  http://host231.itelit.pro/11/11-3.php
	  */

if($_POST){
   $str= $_POST['str'];
   
   $l = mb_strlen($str,"UTF-8");      //довжина рядка;
   echo "<h4>рядок без змін-</4>|".$str."|";
   
   for($i=0; $i<($l-2); $i++){
	   
	   $s1= mb_substr($str,$i,1,"UTF-8");          // берем 1 символ починаючи з i-того
       $s2= mb_substr($str,($i+1),1,"UTF-8");      // берем наступний символ 
	   $s3= mb_substr($str,($i+2),1,"UTF-8");     //наступний за наступним....
	   
	   $zam=$s1.$s2.$s3;                         //приєднані три символи (рядок пошуку $)
	  
	   if($s1==$s2 and $s1==$s3){              // якщо всі три символи рівні...
		   $str=str_replace($zam,$s1,$str);  // замінюємо на один (рядок заміни $s1)
	   }
   }
   echo"<h4>замінений рядок-</h4>|".$str." ";
	   
}


?>