------------------- Двовимірні масиви -------------------------------

9-0.Створити двовимірний масив "season" Пори року. 

			Вивести масив на екран: 
			'Зима':		'Грудень','Січень','Лютий'  
			'Весна':	'Березень','Квітень','Травень'
			'Літо':		'Червень','Липень','Серпень'
			'Осінь':	'Вересень','Жовтень','Листопад'

--------------------------------------------------------------------
9-1.Створити двовимірний масив "list" з оцінками учнів з інформатики. 
	Вивести масив на екран  у  вигляді  таблиці.
	
$list=array(
	'Василь'=> array(12,'н',8,'н','Н',10,10),
	'Марія'	=> array('8','','н','','4','н','7'),
	'Ірина'	=> array('н','11','','н','7','','6'),
	'Петро'	=> array('','8','8','9','','н','7'),
	'Саша'	=> array('н','н','н','','9','н','7'),
	'Коля'	=> array('9','','8','10','10','11','12'),
	'Гріша'	=> array('9','','','','','7','н'),
	'Оля'	=> array('н','н','','','6','',''),
	'Галя'	=> array('4','5','','н','н','н','5'),
	'Тарас'	=> array('10','10','8','н','11','12','9'),
);
---------------------------------------------------------------------
9-2.Створити двовимірний масив "Inform" з оцінками учнів з інформатики. 
	Порахувати середній бал кожного учня і середній бал класу.	

9-3.Створити двовимірний масив "name" з оцінками учнів з інформатики. 
	Порахувати кількість оцінок у кожного учня $count_id 
	і кількість оцінок у всіх учнів $count_class.

9-4.Створити двовимірний масив "name" з оцінками учнів з інформатики. 
	Порахувати кількість пропусків у кожного учня і кількість пропусків в класі.

9-5.Створити двовимірний масив "name" з оцінками учнів з інформатики. 
	Визначити (ім'я вивести на екран) учня який отримав найбільше оцінок, 
	якщо таких учнів декілка, тоді імена всіх вивести на екран.
	
9-6.Створити двовимірний масив "name" з оцінками учнів з інформатики. 
	Визначити учня що має найбільше пропусків.	
	
9-7.Створити двовимірний масив "Inform" з оцінками учнів з інформатики. 
	Визначити найкращого учня. Найкращий учень - той, що має найвищий середній бал.	

