<?
/*	9-0.	Створити двовимірний масив "season" Пори року. 
	
			Вивести масив на екран: 
			'Зима':		'Грудень','Січень','Лютий'  
			'Весна':	'Березень','Квітень','Травень'
			'Літо':		'Червень','Липень','Серпень'
			'Осінь':	'Вересень','Жовтень','Листопад'
*/
echo"<h3>Пори року</h3>";
$season= array(

'Зима' => array('Грудень','Січень','Лютий'),
'Весна' => array('Березень','Квітень','Травень'),
'Літо' => array('Червень','Липень','Серпень'),
'Осінь' => array('Вересень','Жовтень','Листопад')
);

foreach($season as $key => $value){
	echo"<br><b>".$key.": </b>";
	for($i=0; $i<count($value); $i++){
	   echo	$value[$i]." ,";
		
	}
	
	
	
}






?>