<?
/*	5.1 Створити програму "Калькулятор". 
		По центру екрану створити таблицю з двома полями для введення чисел 
		і чотирьма кнопками "+" ,  "-" ,  "*" ,  "/" .
		
		Відображення 1 файлу повинно бути таким:
		«_______»   «________»
		[+]	[-]	[*]	[/]
		
Відображення 2 файлу  при введені у поля чисел 1, 2  
і натисненні кнопки [+] буде таким: 	1 + 2 = 3
Відображення 2 файлу  при введені у поля чисел 3, 2  
і натисненні кнопки [*] буде таким: 	3 * 2 = 6
*/


	

$a=$_POST['a'];
$b=$_POST['b'];

$button=$_POST['button'];

if  ($button=='+'){
$c=$a+$b;
echo $a."+".$b."=". $c;		
}
if  ($button=='-'){
	$c=$a-$b;
	echo $a."-".$b."=". $c;	
}
if  ($button=='*'){
	$c=$a*$b;
	echo $a."*".$b."=". $c;	
}
if  ($button=='/'){
	$c=$a/$b;
	echo $a."/".$b."=". round($c,2);	
}
echo " 
<table align ='center'  width='300' border='1px'>
<tr> <th>Число1</th>  <th>Oперація </th>  <th>Число2</th> <th>Дорівнює</th> <th>Результат</th> </tr>

<tr>
<th>".$a."</th>  <th>".$button."</th> <th>".$b."</th> <th>=</th><th>".round($c,2)."</td>
</tr>
  </table>"
  
?>
