<?	
/*	5.3	Створити програму "Тест по HTML i CSS" (12 питань) на знання мови HTML i CSS:
	1) вибір однієї вірної відповіді з декількох запропонованих - 4 питання ;
	2) вибір декількох вірних відповідей  з запропонованих - 4 питання ;
	3) введення вірної відповіді у текстове поле - 4 питання ;
	4) вибір вірної відповіді з "випадаючого" списку - 4 питання.
Тест оформити у вигляді сайту з використанням таблиці стилів: style.css	
*/



/*	1.	Який тег використовується для створення окремих комірок таблиці? 
		( t1 - Текстове поле	 trim($t1) - функція видаляє пропуски)	*/



/*	2.	Який атрибут тега <TABLE> використовують для визначення ширини таблиці?		
		( r2 - Перемикач		&lt;TABLE&gt;	)	*/

		
/*	3.	Що є результатом виконання наступного html-коду: <TR bgcolor="green"> ?	
		( r3 - Перемикач)*/	


/*	4.	Атрибут colspan визначає...													
		( r3 - Перемикач )	*/


/*	5.	До складу якого тегу може входити атрибут rowspan?							
		( c5_1 - c5_4   -  Прапорці )	*/


/*	6.	Відстань між рамками комірок таблиці <br>визначається за допомогою атрибуту...
		( s6 - Список )	*/

/*	7.	Який тег відповідає за підключення таблиці стилів?		
		(r4 - Перемикач)	*/


/*	8.	Який атрибут вказує на те, що встановлюється зв'язок з таблицею стилів 		
		(s8 - Список)*/


/*	9.	Який атрибут тегу <LINK> вказує повне ім'я css-файлу, що підключується		
		(r9 - Перемикач)*/


/*	10.	Які значення може приймати властивість text-align - вирівнювання тексту?	
		( c10_1 - c10_5   -  Прапорці )*/


/*	11.	Які значення може приймати властивість font-size - розмір шрифту?			
		( c11_1 - c11_5   -  Прапорці )*/


/*	12.	Оберіть три основні способи селекції у css-файлі							
		( c12_1 - c12_5   -  Прапорці )*/

/*----------------------------------------------------------------------------------*/




?>








