<?
$bal=0;

/*	1.	Який тег використовується для створення окремих комірок таблиці? 
		( t1 - Текстове поле	 trim($t1) - функція видаляє пропуски)	*/
@$t1=$_POST['t1'];
if($t1=='TD' or $t1=='td' or $t1=='<TD>' or $t1=='<td>' ){
	$bal=$bal+3;
}

/*	2.	Який атрибут тега <TABLE> використовують для визначення ширини таблиці?		
		( r2 - Перемикач		&lt;TABLE&gt;	)	*/

@$r2=$_POST['r2'];
if($r2=='2') {
	$bal=$bal+3;
}	
	
/*	3.	Що є результатом виконання наступного html-коду: <TR bgcolor="green"> ?	
		( r3 - Перемикач)*/	
		
@$c3_1=$_POST['c1'];
@$c3_2=$_POST['c2'];
@$c3_3=$_POST['c3'];
@$c3_4=$_POST['c4'];

if($c1!='1' and $c2=='1' and $c3=='1' and $c4!='1') {$bal=$bal+1;}
if($c1!='1' and $c2=='1' and $c3!='1' and $c4!='1') {$bal=$bal+3;}
if($c1!='1' and $c2=='1' and $c3!='1' and $c4!='1') {$bal=$bal+1;}

/*
@$r5=$_POST['r5'];
if($r5=='3') {
$bal=$bal+3;
}

@$c1=$_POST['c1'];
@$c2=$_POST['c2'];
@$c3=$_POST['c3'];
@$c4=$_POST['c4'];

if($c1!='1' and $c2=='1' and $c3=='1' and $c4!='1') {$bal=$bal+1;}
if($c1!='1' and $c2=='1' and $c3!='1' and $c4!='1') {$bal=$bal+3;}
if($c1!='1' and $c2=='1' and $c3!='1' and $c4!='1') {$bal=$bal+1;}
*/
echo $bal;

?>