<?
/*
6.2 
	Створіть програму знаходження суми чисел від 1 до 100.
	
				Відображення файлу повинно бути таким:
				"Сума чисел від 1 до 100 = " _____
				
*********************************************************************************	
1.	Задаємо початковi значення змінним $sum та лічильнику $i
2.	У циклі організуємо обчислення суми з накопиченням ... 
3.	Збільшуємо значення лічильника циклу на 1.
*********************************************************************************
*/
echo "<H2>--------------------------- Цикл for ----------------------------</H2>";
	
$sum=0;
for($i=1; $i<=100; $i++ ){
$sum=$sum+$i;
}

echo "Сума чисел від 1 до 100 = " .$sum;


echo "<H2>-------------------------- Цикл while ---------------------------</H2>";
$sum=0;
$i=1;
while ($i<=100){
$sum += $i;	
$i++;
}
echo "Сума чисел від 1 до 100 = " .$sum;

?>