<?	
/*
6.3 
	Створіть програму, яка допоможе побудувати графік функції y=x2. 
	Значення змінної x змінюється від -10 до 10 з кроком 0.5  
	Програма повинна обчислити всі значення змінної y, 
	а на екран вивести таблицю значень змінних x і y.
	
				Відображення файлу може бути таким:
				№	  X	  	Y
				1	-10		100
				2	-9.5	90.25
				3	-9		81
				4	-8.5	72.25
				5	-8		64
				6	-7.5	56.25
				7	-7		49
				...
				19	9.5		90.25
				20	10		100	

<table border='' align='' width=''></table>
<tr></tr>		<th>*</th>		<td>*</td>
	
*/
echo "<H2>--------------------------- Цикл for ----------------------------</H2>";
       echo"
           <table width='200' border='1' align'center'>
                <tr><th>x</th><th>y</th></tr>
";

for($x=-10; $x<=10; $x+=0.5){

echo"
<tr><td>".$x."</td><td>".$x*$x."</td></tr>
";
}

echo"</table>";
	 
echo "<H2>-------------------------- Цикл while ---------------------------</H2>";

echo"
      <table width='200' border='1' align'center'>
          <tr><th>x</th><th>y</th></tr>
";
$x=-10;
while($x<=10){
       $y=$x*$x;
echo"
<tr><td>".$x."</td><td>".$x*$x."</td></tr>
";
$x+=0.5;
}





	

?>
