<?
/*
6.4 Створіть програму знаходження добутку всіх чисел кратних 3 і меших 20 . 
*/

echo "<H2>--------------------------- Цикл for ----------------------------</H2>";
/*
	1. Спочатку створюємо цикл для всіх чисел від 1 до 5 (перевірка: 120)
	2. Далі, у тілі циклу накладаємо ще одну умову (конструкція if):
			Постає питання. Як перевірити число на кратність 3?
			Скористаємось арифметичною операцією %, яка знаходить остачу від ділення. 
			Якщо остача від ділення змінної $i на число 3 дорівнює 0, 
				(тобто це число ділиться націло на 3, або кратне 3),
				то виконуємо... (домножуємо результат на це число)
				
	ПЕРЕВІРКА: 	Добуток чисел кратних 3 і менших 10 = 162 
*/
 $rez=1;
     for($i=1; $i<=20; $i++){
	       if($i % 3==0){
			$rez=$rez*$i;  
		   }
    }
echo"Добуток чисел кратних 3 і менших 10= ".$rez;   


echo "<H2>-------------------------- Цикл while ---------------------------</H2>";
/*
	1. Спочатку можна створити цикл while аналогічно, з накладанням додаткової умови.
	2. Далі	спробуємо інший спосіб:   
			використаємо цикл з кроком +=3,
			початкове значення лічильника слід покласти рівним 3.
		(це дасть можливість видібрати тільки числа кратні 3, без накладання додаткової умови)
	
	ПЕРЕВІРКА: 	Добуток чисел кратних 3 і менших 20 = 524880
	*/
	$rez=1;
	$i=3;
while($i<20){
		$rez=$rez*$i;  
			$i+=3; 
}

echo"Добуток чисел кратних 3 і менших 20: ".$rez;
?>

