<?
/*
6.6 	Створіть програму виводу на екран всіх чисел кратних введеному і менших = 100. 
		Програма також повинна порахувати кількість таких (кратних) чисел.
		Якщо, наприклад користувач введе число 15, тоді комп'ютер повинен вивести на екран числа: 
			Числа кратні 15 і менші 100:   	15, 30, 45, 60, 75, 90,  
			Кількість кратних чисел:  	    6 
		Якщо, наприклад користувач введе число 25, тоді комп'ютер повинен вивести на екран числа: 
			Числа кратні 25 і менші 100:	25, 50, 75, 100 , 
			Кількість кратних чисел: 		4 
*/
?>

<form action="6-6.php" method="POST">
Введіть число від 1 до 100:
<input type="text" name="m"><br><br>
<input type="submit" name="button" value="Продовжити"><br><br>
</form>