<?
echo "<H2>--------------------------- Цикл for ----------------------------</H2>";


if(@$_POST['t']){
$t=$_POST['t'];
echo"Числа кратні ".$t." і менші 100: <br><br>";
$sum=0;
for($i=$t; $i<=100; $i+=$t){
$sum+=$i;
echo "+".$i;
}
echo" = ".$sum;
}

echo "<H2>--------------------------- Цикл while ----------------------------</H2>";
$i=1;
$n=0;
$sum=0;
if(@$_POST['t']){
$t=$_POST['t'];
while( $i<=100){
if($i%$t==0){
$sum+=$i;
echo "+".$i;
$t++;
}
$i++;
}
echo "<p>Кількість кратних чисел=".$n;
}
?>

