<?
/*
6.7 Створіть програму знаходження cуми всіх чисел кратних введеному і менших = 100.
 
	Якщо користувач введе число 30, тоді результат: 30+60+90 = 180 
	Якщо користувач введе число 20, тоді результат: 20+40+60+80+100 = 300 
	Якщо користувач введе число 40, тоді результат: 40+80 = 120 
	---------------------------------------------------
	Відображення першого файлу - форми може бути таким:
	
	Введіть число від 1 до 100  «___» 
	[Обчислити суму]
	---------------------------------------------------
	Відображення другуго файлу - обробника може бути таким:
	
	Cума всіх чисел кратних 20 і менших 100:
	20+40+60+80+100 = 300 
*/
?>
<form action="6-7.php" method="POST">
Введіть число від 1 до 100:
<input type="text" name="t"><br><br>
<input type="submit" name="button" value="Обчислити суму">
</form>