<?
/*
Запишіть сюда адресу вашого сайту / всі вкладені папки / ім'я файлу!
--------------------------------------------------------------------
Задача 1.1
	Створити програму, що додає значення двох змінних $a і $b. 
	Результат вивести на екран у вигляді:
	Сума чисел 7 і 5 = 12 
--------------------------------------------------------------------
*/

// Задамо значення двом змінним:
$a=7;
$b=5;


// Обчислюємо суму (оператор присвоювання =)
$c=$a+$b;

// Виводимо результат (команда echo)
echo"Сума чисел 7 і 5=".$c;

// Перевірте результат у браузері!!!
?>