<html>
<head>
	<title>Конкотенація</title>
</head>

<body>
<?php
/*
Запишіть сюда адресу вашого сайту / всі вкладені папки / ім'я файлу!
--------------------------------------------------------------------
Задача 1.2b		(2 варіант - )		
	Створити програму, що виводить на екран ваше ім’я, прізвище і вік. Змінні - $name,  $lastname,  $age 
	
	У 2 варіанті цієї задачі  з’єднайте два рядки: 	$name та $lastname в один рядок - $n 
	і виведіть результат на екран у вигляді: "Мене  звати  – Олександр Войтенко, мені  14 років"
			 
	Запишіть скрипт всередині HTML-документа із заголовком: Конкотенація)
	Додайте вирівнювання абзаців: по центру
---------------------------------------------------------------------	
*/
// Задамо значення трьом рядковим змінним:
$name="Анжеліка";
$lastname="Гаврилюк";
$age ="15 років";		

		

//З'днаємо два рядки в один і запишимо у змінну $n (операція: Конкотенація)
$n=$name." ".$lastname;

		

//Виведемо результат:
echo"<h1 align='center'>Мене звати: ".$n."<br> Мені ".$age." </h1>" ;

?>	
</body>
	
</html>
		
		
		