<?
/*	
Запишіть сюда адресу вашого сайту / всі вкладені папки / ім'я файлу!
--------------------------------------------------------------------
Задача 1.2		
	Створити програму, що виводить на екран ваше імя, прізвище та вік, 
	які повинні зберігатись у змінних - $name,  $lastname,  $age 
			Результат вивести у вигляді: 
			Моє ім’я – Олександр
			Прізвище – Войтенко
			Мій вік – 15 років 
--------------------------------------------------------------------			
*/

// Задамо значення трьом рядковим змінним: 
$name="Анжеліка";
$lastname="Гаврилюк";
$age ="15 років";

//Виведення методом пристиковки:
echo"Моє ім’я: " .$name."<br>";
echo "Прізвище:".$lastname."<br>";
echo "Мій вік:".$age ."<br>";
?>



