<?
/*
Запишіть сюда адресу вашого сайту / всі вкладені папки / ім'я файлу!
--------------------------------------------------------------------
Задача 1.3		
	Створити програму, що обчислює площу ($S) і об’єм ($V) 
	класної кімнати.  Розміри класу: 
			ширина – 5.2 м;  	($width) 
			довжина – 7.4 м; 	($length) 
			висота 2.8 м.		($height) 
	Результат вивести у вигляді: 
			Площа класної кімнати з шириною - ___, довжиною - ___ = ___ м2
			Об'єм цієї ж кімнати при висоті - ___ = ___ м3
	(на місті підкреслень повинні бути числові  результати )
--------------------------------------------------------------------
*/
//Задаємо змінні:
$width=" 5.2 м";
$length="7.4 м";
$height="2.8 м";

//Обчислюємо площу кімнати:
$S=$length * $width;

//Обчислюємо об’єм кімнати:
$V=$height * $S;

//Виводимо результати:
echo"Площа класної кімнати з шириною -".$width." , довжиною-".$length."
дорівнює".$S."м2<br>";
echo"Об'єм цієї ж кімнати при висоті -".$height.", довжиною-".$length."
дорівнює".$V."м3";
?>


