<?
/*
Запишіть сюда адресу вашого сайту / всі вкладені папки / ім'я файлу!
--------------------------------------------------------------------
Задача 1.4	
	Створити програму, що обраховує час у годинах руху автомобіля з м.Рівне до м.Київ, 
	якщо середня швидкість руху – 60 км/год, а відстань від Рівного до Києва – 327км.
								V=S/t , тоді  t=S/V
	Результат вивести у вигляді: 
			Автомобіль, що рухається з середньою швидкістю  ____  км/год,
			з Рівного до Києва дістанеться за _____ год.					
	(на місті підкреслень повинні бути числові  результати )
*/
$V="60 ";
$S="327";
 $t=$S/$V;
 
 echo"Автомобіль, що рухається з середньою швидкістю ".$S." км/год
 з Рівного до Києва дістанеться за".$t."год.	";
?>