<?
/*
Запишіть сюда адресу вашого сайту / всі вкладені папки / ім'я файлу!
--------------------------------------------------------------------
Задача 1.5
	Обчислити середнє арифметичне значення трьох чисел: 7, 3, 8
	Використовуйте імена змінних: a, b, c, rez
	Результат вивести на екран у вигляді:
	Середнє арифметичне значення трьох чисел: ... , ... , ... дорівнює ...
--------------------------------------------------------------------------	
*/
$a="7";
$b="3";
$c="8";
$rez=($a+$b+$c)/3;


echo"Середнє арифметичне значення трьох чисел:".$a.", ".$b.",
".$c."дорівнює  ".$rez." ";




?>