---------------------- Урок 1-1	Доступ на сервер ------------------------

1.	Вам потрібно  отримати  хостинг  і домен!!!
	Ця інформація зберігаеться у Exel-файлі, у папці ПРАКТИКА!!!

2.	Для спрощеного доступу на сервер Вам знадобиться  FTP-клієнт
	Встановити Notepad++ та запустити його.

3.	У Notepad++ є вбудований плагін NppFTP. 
	Це простий та зручний FTP–клієнт.
	Запускається він за допомогою кнопки:	 Show NppFTP Window
	
4.	Створюємо свій профіль:

	-	У вікні вбудованого FTP-клиента тиснемо "шестерінку" ("Setting") 
	-	Обираємо "Profile settings" ("Налаштування профіля")
	-	У вікні тиснемо кнопку:	 	Add new
	-	Вводимо ім'я свого профілю:	203_Family (Наприклад: 203_Aletdinov)
	-	Заповнюємо поля із Exel-файлу:		
			Hostname	-	Хост	-	v333.ftp.ukraine.com.ua
			Username	-	Логін	-	v333_161
			Password	-	Пароль	-	1tmg2y91
	-	Тиснемо кнопку Close 
	
5.	Обираємо свій профіль: 

		-	натисніть кнопку з'єднання, це перша кнопка: (Dis)Connect
		-	оберіть свій профиль:		 203_Aletdinov
		-	якщо все вірно, ви побачите свою кореневу папку 
			та індексний файл вашого пробного сайту

-------------------------ПЕРЕВІРКА----------------------------------

	Для перевірки роботи створіть файл index.php  (index.html),
	де можна записати своє власне Прізвище та ім'я.   Наприклад,

	-	натисніть праву кнопку миші на папці site
	-	оберіть команду:		Create new file 
	-	введіть ім'я файлу: 	index.php 	
	
	Введіть відповідні html-теги та додайте тег заголовку 
	першого рівня зі своїми даними (Прізвище та ім'я): 
	
<html>
<head>
	<title>ПЕРЕВІРКА</title>
</head>
<body>
	<h1>ЦЕ МІЙ САЙТ:  Алєтдінов Олексій</h1>
</body>
</html>	

	Перевірте роботу сайту у вікні браузера!!!
	
	Для цього введіть у адресний рядок браузера адресу Вашого сайту.
	Ця інформація зберігається у папці ПРАКТИКА
	
	ПРАКТИКА/Olena Leonidivna/Школа програмування/php/01
	
------------------ Папки та файли на сервері ------------------------

ОСОБЛИВІСТЬ роботи на нашому хостінгу: 
	На Вашому хостінгу Ви побачите дві стандартні папки logs, site 
	Файли та папки, що їх Ви будете створювати, слід зберігати у папці site.
	Папка logs має залишатися пустою.
---------------------------------------------------------------------

1.	У папці site створюємо нову папку php (в ній будуть всі теми нашого курсу php)

	-	натисніть праву кнопку миші на папці site
	-	оберіть команду:		Create new directory 
	-	введіть ім'я папки:		php 
	
2.	Створюємо вкладену папку 01 (в ній будуть зберігатися задачі першої теми курсу)

	Отримаємо таку структуру папок: 	site/php/01/
	
4.	Тепер запишемо даний текстовий документ 01-host.txt на свій хост,
	у свою структуру папок:		site/php/01
	
	Для цього:
	-	клікніть на папці 01 щоб зробити її поточною
	-	натисніть стрілку вверх (це кнопка: Upload file)
	-	поточний файл 01-host.txt запишиться у поточну папку 01

5.	Залийте на сервер, у папку 01, інші файли, запропоновані вчителем.
	Потрібні файли ви знайдете у папці:
	
	ПРАКТИКА/Olena Leonidivna/Школа програмування/php/01	

	Список файлів, що слід залити на хостінг, у Вашу структуру папок:   site/php/01/
	
			01-host.txt		-	Доступ на сервер
			01-task.txt		-	Задачі
			01-theory.txt	-	Мова програмування PHP (теоретичний матеріал)
	
			1-1.txt			-	Файл-заготовка для першої програми
			1-2.txt			-	Файл-заготовка для першої програми
	
6.	Перевірка роботи php-коду у вікні браузера!!!
	
	-	Створіть у папці 01 новий файл    1-0.php
	- 	Відкрийте php-код
	-	Введіть команду   echo"", що організовує виведення на екран
	
<?
echo "Перевірка роботи php-коду";
?>
	
	
	
	
	
	
	