----------------------- Мова програмування PHP ---------------------------

---------- 1.Числові і рядкові змінні. Математичні операції --------------

Змінна - 	це область оперативної пам'яті, доступ до якої здійснюється по імені.
			Всі дані, з якими пацює програма, зберігаються у вигляді змінних.

1.	Правила запису імен змінних:
	-	імена змінних починаються знаком $
	-	в іменах можуть бути латинські літери (великі та малі),
		цифри та символ підкреслення
	-	після $ не може бути цифра
	-	назви змінних чутливі до регістру букв ($Name і $name - це різні змінні)

2.	Вкінці кожної команди ставимо ;

3.	Приклади команд:
	$b1=5;
	echo $b1;

4.	Математичні операції:
	$a + $b		сума
	$a - $b		різниця
	$a * $b		добуток
	$a / $b		частка
	$a % $b		ділення по модулю (остача від ділення $a на $b)
				наприклад: остача від  ділення числа  15 на число 7 = 1;


	
	
	