----------------------- Тема 1.  З А Д А Ч І ---------------------

Тема 1. Числові і рядкові змінні. Математичні операції.

------------------------------------------------------------------
1.1 Створити програму, що додає значення двох змінних $a і $b. 
	Результат вивести на екран у вигляді:
	Сума чисел 7 і 5 = 12 
------------------------------------------------------------------ 
1.2	Створити програму, що виводить на екран ваше ім’я, прізвище і ваш вік.  
	Ім’я, прізвище і вік 	повинні зберігатись у змінних - $name,  $lastname,  $age 
-----
1.2.a 	Результат вивести у вигляді: 

		Моє ім’я – Олександр
		Прізвище – Войтенко
		Мій вік – 15 років 
-----
1.2.b  	У варіанті 2 цієї ж задачі  з’єднайте два рядки: $name, $lastname в один - $n 
		і виведіть результат на екран у вигляді:
		
		Мене  звати  – Олександр Войтенко, мені  14 років.
------------------------------------------------------------------ 
1.3 Створити програму, що обраховує площу і об’єм класної кімнати.  
	Розміри класу: ширина – 5,2м;  	довжина – 7,4м; висота 2,8м.
	Результат вивести у вигляді: 
	
	Площа класної кімнати з шириною - 5.2, довжиною - 7.4 = 38.48м2
	Об'єм цієї ж кімнати при висоті - 2.8=107.744м3
------------------------------------------------------------------
1.4 Створити програму, що обраховує час у годинах руху автомобіля з м.Рівне до м.Київ, 
	якщо середня швидкість руху – 60 км/год, а відстань від Рівного до Києва – 327км.
								V=S/t
	Результат вивести у вигляді: 
	Автомобіль, що рухається з середньою швидкістю  ____  км/год,
	з Рівного до Києва дістанеться за _____ год.					
	(на місті підкреслень повинні бути числові  результати )
------------------------------------------------------------------
------------------------------------------------------------------
1.5	Обчислити середнє арифметичне значення трьох чисел: 50, 80, 35
------------------------------------------------------------------