<?	/*---------	ВЛАСНА БІБЛІОТЕКА ФУНКЦІЙ ----------*/

/*	area_sqr($x)-------------------------------------1
	Обчислити площу квадрата. 
	$x-довжина сторони квадрата.
*/
function area_sqr($x){
$y=pow($x,2);
return $y;
}

/*	area_circle($x)----------------------------------2
	Обчислити площу кола. $r-радіус кола.
*/
function area_circle($x){
$y=pi() *pow($x,2);
return $y;
}

/*	max_num($x,$y,$z)--------------------------------3
	Обчислення найбільшого серед трьох чисел. 
	$a,$b,$c-задані числа.
*/
function max_num($x,$y,$z){
$max=$x;
if($y>$max){
$max=$y;
}
if($z<$max){
$max=$z;
}
return $max;
}


/*	this_triangle($x,$y,$z)--------------------------4
	Можливість побудови трикутника за трьома сторами.
*/
function this_triangle($x,$y,$z){
if ($x>=($y+$z) or $y>=($x+$z) or $z>=($x+$y)){
       return false;
   }
   else{
       return true;
   }
}


/*	area_triangle($x,$y,$z)--------------------------5
	Обчислення площі трикутника за його сторонами. 
	Формула Герона.
*/
function area_triangle($x,$y,$z){
$a=this_triangle ($x,$y,$z);
if($a) {
$p=($x+$y+$z)/2;
$S=sqrt($p*($p-$x)*($p-$y)*($p-$z));
}
return $S;
}

 
/* 	inside_rectangle($x,$y,$x1,$y1,$x2,$y2)----------6
	Визначає чи точка з координатами x, y знаходиться 
	всередині прямокутника з координатами x1,y1,x2,y2
*/ 
function 	inside_rectangle($x,$y,$x1,$y1,$x2,$y2) {
	if($x>=$x1 and $x<=$x2 and $y>=$y1 and $y<=$y2){
		 return true ;
   }
   else{
       return false;
   }
}


/* 	inside_rectangle($x,$y,$xc,$yc,$r)--------------7
	Визначає чи точка з координатами $x,$y знаходиться всередині кола.
	Координати центра кола: $xc, $yc. Радіус кола: $r.
*/



/* 	max_array($x)-----------------------------------8
	Визначає максимальне значення масиву $x
(20,4,1,19,3,7,21,15,95,5)
*/

/*	is_in_array($x, $v)-----------------------------9
	Функція, яка у одновимірному масиві $x шукає значення $v. 
	Функція повертає  true у випадку, якщо значення $v є у масиві.
("Авраменко","Арабей","Буніна","Кучерук","Лермонтова","Самойленко","Яцик")	
*/


/*	sort_array($x)----------------------------------10++
	Функція повертає відсортований одновимірний масив $x цілих чисел. 
*/


?>

