<?
/*
8.1 	У програмі є два масиви   $frukty,  $cinaFr:
		----------------------------------
			$frukty:	  	$cinaFr:
			--------		--------
		№	Назва			Ціна за 1кг.
		1	Абрикос			25
		2		Ананас		40
		3	Алича			10
		4	Айва			50
		5	Вишня			25
		6	Слива			15
		7	Яблуко			8	
		----------------------------------
	Створіть програму, яка шукає: 	
	1) 	товари за заданою конкретною ціною.
	
	Для введення критеріїв пошуку створіть форму.
*/
?>
<form action="8-1.php" method="POST">
     Введіть ціну товара в (грн):
     <input  type="text"  name="cina" size="2"><br>
     <input type="submit" name="button" value="Продовжити">
</form>
<?
$frukty=array("Абрикос","	Ананас","Алича","Айва","Вишня","Слива","Яблуко	");
$cinaFr=array(        25,             40,         10,       50,          25,          15,           8       );
if($_POST) {
    $cina=$_POST['cina'];
      $n=0;
      for($i=0; $i<count($frukty);  $i++){
	         if($cinaFr[$i]==$cina){
			       echo $frukty[$i]." - ".$cinaFr[$i]."грн.<br>";
			         $n++;
			 }
	   }
if($n==0){"Такого товару немає у списку";}  
echo"<h3>Кількість:  ".$n."</h3>";
}
?>



