<?/*---------------------------------------------------------------------------------------

1. 	Додамо три пункта меню в комірку  М Е Н Ю:
 
	1. Посилання з якорем 		Мерседес 	та атрибутом 	href='?menu=1' 
	2. Посилання з якорем 		БМВ 		та атрибутом 	href='?menu=2'  
	3. Посилання з якорем		Ауди		та атрибутом 	href='?menu=3'
		
	Такий запис у атрибуті  href  тега <a> означає, що файл буде перезавантажено,
	і у нього методом GET, через адресний рядок, буде передана глобальна змінна 'menu'.  
	Ця змінна $_GET['menu'] матиме певне значення 1,2 або 3 - залежно від того, 
	по якому посиланню клікнув користувач.

----------------------------------- Додаємо РНР-код -----------------------------------
	Після інструкції include:
	
2. 	Приймаємо глобальну змінну   $_GET['menu']   у локальну   $menu.
	
3. 	Додаємо перевірку існування глобальної змінної: 
		Якщо глобальна змінна не існує, то значення локальної змінної  $menu=1,
		тобто перший пункт меню - Мерседес - за замовчуванням.

4.	Виведемо на екран значення локальної змінної. Це значення буде виведено перед таблицею!

------------------------ С Т И Л І З А Ц І Я   М Е Н Ю --------------------------------

5. Накладаємо  стилі на посилання у меню, тобто на на об1ект с id='menu':

	#menu a				стиль на посилання: 	
								шрифт: 			bold 20px tahoma	
								display:		block	
								нижнее поле:	8px	
								без підкресення 	
								колір: 			#909090
	a:hover				після її використання:
								колір: #ffffff
---------------------------------------------------------------------------------------	
*/			
include "start.php";	

if ($_GET){
  $menu=$_GET['menu'];
}
else{
	$menu =1;
}
echo"<h1>-------------".$menu."-------------</h1>";
?>





<html>
   <head>
        <title>Кращі автомобілі-1</title>
		<link rel="stylesheet" type="text/css" href="style.css"/>
		</head>
		
		<body>
		    <table  id='center' border="1">
			<tr>
			  <td id='logo_text'>КРАЩІ АВТОМОБІЛІ СВІТУ</td>
			  <td rowspan="2">
			  <?
			  echo "Тут будуть К А Р Т И Н К И";
			  ?>
			  </td>
			</tr>
			<tr>
			  <td id='menu'>
			  <?
			  echo "<a href='?menu=1'>Мерседес</a>";
			  echo "<a href='?menu=2'>БМВ</a>";
			  echo "<a href='?menu=3'>Ауді</a>";
			  ?>
			  </td>
		    </tr>  
		</table>
	</body>
</html>




