
	$action_menu=get_action_menu();  	// Повертає число (1, 2 або 3) номер активного пункту меню
	$menu=get_menu(); 					// Повертає 2-вимірний масив з назвами і номерами автомобілів
	$foto=get_foto($action_menu); 		// Повертає 1-вимірний масив з комірками з посиланнями на фото автомобілей

---------------------------------------------------------------------------------------------------------------
	Написати все у вигляді функцій:
	
	
	function get_action_menu()

	function get_menu()

	function get_foto($am)
	
	
	
	function print_menu($menu)			// пункти  М Е Н Ю  із  таблиці  car
	
	function print_foto($foto)			// К А Р Т И Н К И  із  таблиці  fotoavto